backend/app/controllers/tours_controller.rb

  def index
    @tours = Tour.all
---
SELECT `tours`.* FROM `tours`

  def create
    @tour = Tour.new(tour_params)

    respond_to do |format|
      if @tour.save
---
INSERT INTO `tours` (`name`, `maxAttendees`, `price`, `startDate`, `endDate`, `createdFrom`, `changedFrom`, `syncedFrom`, `created_at`, `updated_at`) VALUES ('Roland', 12, 1234.0, '2017-05-23 15:33:00', '2017-05-23 15:33:00', 'Mr', 'Roland', 1, '2017-05-23 15:34:15', '2017-05-23 15:34:15')

    def set_tour
      @tour = Tour.find(params[:id])
---
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 1 LIMIT 1