backend/app/controllers/api/v1/tours_controller.rb

SELECT `tours`.* FROM `tours`
---
  def index
    @tours = Tour.all